import type { DocumentSection } from "@/lib/promotion-rules-content";

export const PERSONAL_DATA_CONSENT_SECTIONS: DocumentSection[] = [
  {
    title: "Согласие пользователя сайта на обработку персональных данных",
    paragraphs: [
      "Проставляя чек-бокс «Согласен на обработку персональных данных», я подтверждаю, что являюсь субъектом персональных данных (далее — Субъект ПДН).",
      "Проставляя чек-бокс «Согласен на обработку персональных данных», в соответствии со статьями 6 и 9 Федерального закона от 27.07.2006 №152-ФЗ «О персональных данных» я даю согласие Акционерному обществу «РЭКС Моторс» (далее — Оператор), расположенному по адресу: 143007, Московская область, г.о. Одинцовский, г. Одинцово, улица Вокзальная, дом 3Б, на обработку моих персональных данных посредством сбора, записи, систематизации, накопления, хранения, уточнения (обновления, изменения), извлечения, использования, передачи (предоставление, доступ), обезличивания, блокирования, удаления, уничтожения, совершаемые как с использованием средств автоматизации, так и без использования таких средств. Обработка персональных данных будет осуществляться с целью: оформления заявки для направления дилеру для получения консультации о приобретении и/или обслуживании автомобиля, прохождения тест-драйва и участия в Акции «KGM Torres. Тест-драйв».",
      "Перечень персональных данных Субъекта ПДН, обрабатываемых Оператором для указанной в настоящем согласии цели: имя, адрес электронной почты, телефон.",
      "Субъект ПДН выражает свое согласие на предоставление Оператором персональных данных Субъекта ПДН дилеру, выбранному Субъектом ПДН, в поле «Дилерский центр».",
      "Перечень персональных данных Субъекта ПДН, передаваемых Оператором третьим лицам для указанных целей: имя, адрес электронной почты, телефон.",
      "Настоящее согласие действует с момента его подписания в течение 5 лет либо до достижения целей обработки персональных данных, указанных в настоящем согласии, либо до отзыва Субъектом ПДН настоящего согласия в письменной форме.",
      "Субъект ПДН выражает свое согласие на поручение Оператором третьему лицу Костина Елена Михайловна, ИНН 771670791890, ОГРН 323774600714696 по адресу 129346, Москва, ул. Малыгина д.3 корп. 2 кв. 24 обработку персональных данных в целях технической поддержки Сайта Акции.",
      "Настоящее согласие может быть отозвано путём направления Заявления Субъектом ПДН Оператору по адресу: 143007, Московская область, г.о. Одинцовский, г. Одинцово, улица Вокзальная, дом 3Б; ИНН: 5032381460. Заявление направляется об отзыве согласия на обработку персональных данных в письменной форме. В этом случае Оператор прекращает обработку персональных данных Субъекта ПДН, а персональные данные подлежат уничтожению. Оператор вправе продолжить обработку персональных данных Субъекта ПДН без его согласия, при наличии оснований, предусмотренных законодательством Российской Федерации.",
    ],
  },
];
